БухЭксп/InformationRegisters/CW_ЛицаПодписывающиеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЛицаПодписывающиеДокументы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительДолжностьАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительОснованиеАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлБухгалтерОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлБухгалтерОснованиеАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыЛицПодписывающихДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокПрисвоенияНомеров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокПрисвоенияИсходящихНомеров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетРасчетов_Поставщики_Рубли</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетРасчетов_Поставщики_Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетРасчетов_Поставщики_УЕ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетРасчетов_Клиенты_Рубли</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетРасчетов_Клиенты_Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетРасчетов_Клиенты_УЕ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетаФактурыПоПостановлению1137</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребованияПостановления735</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗановоФормироватьПредставлениеПриПеревыставленииЗатрат</Name>
					<Comment>если флажок снят, то представление наследуется в точности, если установлен, то создаётся по обычному шаблону</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеОрганизацииАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьРуководителяОрганизацииАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресОрганизацииАнгл</Name>
					<Comment>Адрес нашей организации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопИнфоДляПечатиСчетовПодвалРус</Name>
					<Comment>Дополнительная информация для печати счетов в валюте (рус.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопИнфоДляПечатиСчетовПодвалАнгл</Name>
					<Comment>Дополнительная информация для печати счетов в валюте (англ.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОтраженияАвансовПоВозмещаемымДляУСН</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияАвансовПоВозмещаемымДляУСН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьСтрокуКомиссионераВСчетахФактурах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешнийНумератор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьСчетаФактурыНаПеревыставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВидаОперацииДляВходящихСчетовФактур</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВидаОперацииДляИсходящихСчетовФактур</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетализироватьЗаписиКУДиР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяСтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойСпособУчетаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьСчетаПокупателюНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьСчетаПоставщикаНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппировкаЗатратПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокЗаполненияЖурналаСчетовФактурПоПостановлению735</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяСуммаСчетФактурыВСтрокахСводных</Name>
					<Comment>Применять рекомендации по письму № ЕД-4-15/21535@ от 08.12.2015</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяПрочихДоходовИРасходовДляКорректировок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитикаКорректировкиОперативнойЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодставлятьПлатежныеДокументыПоРасходам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьНаПечатьПолныйНомерДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьКурсыВалютАвансовДляБазыНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокОтраженияАванса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокОтраженияАвансов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстанавливатьТекущуюДатуИсходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокНумерацииПутевыхЛистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешнийНумераторПутевыхЛистов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантУчетаНЗП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВариантУчетаНЗП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВедетсяУчетНЗП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлатежныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьЛоготипВПечатнуюФормуСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НЗППараметрНеВключать</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НЗППараметрДатаРеализации</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НЗПОтражатьВНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВедетсяУчетНЗПДирективно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьНДСВСебестоимости</Name>
					<Comment>включать НДС в себестоимость входящих услуг</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвояОрганизацияВКачествеПокупателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвояОрганизацияКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвояОрганизацияДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_НачалоВеденияУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_НачалоВеденияУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаВеденияУчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonModules/CW_Настройки/Ext/Module.bsl
// ---------------------------------------------------------------------------- 
// НАСТРОЙКИ
// ----------------------------------------------------------------------------

Функция Пользователь() Экспорт 
	// --- 
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат(ПараметрыСеанса.ТекущийПользователь);
	
	// --- 
КонецФункции


// Функция - ПолучитьНастройкуПользователя()
//
// Параметры:
//    Пользователь – пользователь, для которого получается настройка. Если пользователь не указан, то настройка возвращается для текущего пользователя.
//    ИмяНастройки – строка с названием настройки.
// 
// Возвращаемое значение:
//    Возвращает значение индивидуальной настройки пользователя. Если передано несуществующее имя настройки, то возвращается Неопределено. 
//
Функция ПолучитьНастройкуПользователя(Знач Пользователь=Неопределено, ИмяНастройки, ПечатныеФормы = Ложь) Экспорт 
	
	НастройкиПользователя = ПолучитьНастройкиПользователя(Пользователь);
	
	Если НастройкиПользователя.Свойство(ИмяНастройки) Тогда
		ЗначениеНастройки = НастройкиПользователя[ИмяНастройки]; 
		Если Не ЗначениеЗаполнено(ЗначениеНастройки) и ПечатныеФормы Тогда
			Возврат Неопределено;
		КонецЕсли;
		Возврат ЗначениеНастройки;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ПолучитьНастройкиПользователя(Знач Пользователь=Неопределено) Экспорт 
	
	Пользователь = ?(Пользователь = Неопределено, ПараметрыСеанса.ТекущийПользователь, Пользователь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ *
	|ИЗ
	|	РегистрСведений.CW_НастройкиПользователей КАК CW_НастройкиПользователей
	|ГДЕ CW_НастройкиПользователей.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураПараметров = Новый Структура;
	Для Каждого Колонка из РезультатЗапроса.Колонки Цикл  
		
		ДоступныеТипы = Колонка.ТипЗначения.Типы(); 
		Индекс = ДоступныеТипы.Найти(тип("Null"));
		Если Индекс <> Неопределено Тогда
			ДоступныеТипы.Удалить(Индекс);
		КонецЕсли;  
		
		Если ДоступныеТипы.Количество() = 1 Тогда
			ОписаниеТипа = Новый ОписаниеТипов(ДоступныеТипы);
			ПустоеЗначение = ОписаниеТипа.ПривестиЗначение(Неопределено);
		КонецЕсли;
		
		СтруктураПараметров.Вставить(Колонка.Имя, ПустоеЗначение);
	КонецЦикла;   
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, Выборка);
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ПолучитьФизЛицоПользователя(Пользователь) Экспорт 
	// --- 
	
	Возврат Пользователь.ФизическоеЛицо;
	
	// --- 
КонецФункции
  
Функция ПараметрДоговора(Дата, ОбъектПараметров, ИмяПараметра) Экспорт
	
	Если (Дата=Неопределено) Тогда
		Дата = ТекущаяДата();
	КонецЕсли; 
	
	Если ТипЗнч(ОбъектПараметров) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		Организация = ОбъектПараметров.Организация;
	Иначе
		Организация = ОбъектПараметров.Договор.Организация;
	КонецЕсли;
	
	Если ИмяПараметра = "РасчетныйСчетОрганизации" Тогда 
		Возврат Организация.ОсновнойБанковскийСчет;
	КонецЕсли;
	
	Если Найти("/ДопИнфоДляПечатиСчетовПодвалРус/ДопИнфоДляПечатиСчетовПодвалАнгл/", ИмяПараметра)<>0 Тогда 
		Возврат ПараметрУчетнойПолитики(Дата, Организация, ИмяПараметра);
	КонецЕсли;
	
	ЗначениеПараметра = Неопределено;
	
	СтруктураПараметров = ПараметрыДоговора(Дата, ОбъектПараметров, ИмяПараметра);
	СтруктураПараметров.Свойство(СокрЛП(ИмяПараметра), ЗначениеПараметра);

	Возврат ЗначениеПараметра;
	
КонецФункции

Функция ПараметрыДоговора(Дата, ОбъектПараметров, ИмяПараметра="") Экспорт
	
	СтруктураПараметров = Новый Структура;

	Если ТипЗнч(ОбъектПараметров) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
		ДоговорВладелец		= ОбъектПараметров.Владелец;
		ОрганизацияДоговора = ОбъектПараметров.Организация;
		ВалютаДоговора 		= ОбъектПараметров.ВалютаДоговора;
	Иначе
		ДоговорВладелец		= ОбъектПараметров.Договор.Владелец;
		ОрганизацияДоговора = ОбъектПараметров.Договор.Организация;
		ВалютаДоговора 		= ОбъектПараметров.Договор.ВалютаДоговора;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	*
	|ИЗ
	|	РегистрСведений.CW_ПараметрыДоговоров.СрезПоследних(&Дата, Договор = &Договор) КАК CW_ПараметрыДоговоровСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", 		Дата); 
	Запрос.УстановитьПараметр("Договор", 	ОбъектПараметров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Для Каждого Колонка из РезультатЗапроса.Колонки Цикл 
		Если СтрНачинаетсяС(Колонка.Имя, "УДАЛИТЬ") Тогда
			Продолжить;
		КонецЕсли;
		
		мТипыЗначения  = Колонка.ТипЗначения.Типы();
		ИндексТипаNull = мТипыЗначения.Найти(Тип("Null"));
		Если ИндексТипаNull <> Неопределено Тогда
			мТипыЗначения.Удалить(ИндексТипаNull);
		КонецЕсли;
		
		ПустоеЗначение = Неопределено;
		Если мТипыЗначения.Количество() = 1  Тогда
			мТип = Новый Массив;
			мТип.Добавить(мТипыЗначения[0]);
			
			ОграничениеТипа = Новый ОписаниеТипов(мТип);
			ПустоеЗначение  = ОграничениеТипа.ПривестиЗначение(ПустоеЗначение);
		Конецесли;
		
		СтруктураПараметров.Вставить(Колонка.Имя, ПустоеЗначение);
	КонецЦикла;
	
	Если РезультатЗапроса.Пустой() Тогда
		Если ЗначениеЗаполнено(ОбъектПараметров) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для договора "+Строка(ОбъектПараметров)+" с "+Строка(ДоговорВладелец)+" на дату "+Формат(Дата,"ДФ=dd.MM.yyyy")+" не установлены параметры!";
			Сообщение.Сообщить(); 
			Возврат СтруктураПараметров;
		КонецЕсли;
	КонецЕсли;
	
	
	Выборка  = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, Выборка);
	
		СведенияОбОрганизации = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(ОрганизацияДоговора, Дата);
		
		//из карточки организации(0), фиксированные(1), динамические(2)  
		Если Выборка.РежимПодписей = 0 Тогда
			
			Если СведенияОбОрганизации.Свойство("ДолжностьРуководителяПредставление") Тогда
				СтруктураПараметров.ДолжностьРуководителяОрганизации 	= СведенияОбОрганизации.ДолжностьРуководителяПредставление;
			КонецЕсли;
			Если СведенияОбОрганизации.Свойство("Руководитель") Тогда
				СтруктураПараметров.РуководительОрганизации  			= СведенияОбОрганизации.Руководитель;
			КонецЕсли;

		ИначеЕсли Выборка.РежимПодписей = 2 Тогда  
			
			ВыборкаЛицПодписывающихДокументы = ПолучитьПодписиОтветственныхЛиц(Выборка.ВариантПодписей, ОрганизацияДоговора, Дата);
			Если ВыборкаЛицПодписывающихДокументы <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтруктураПараметров, ВыборкаЛицПодписывающихДокументы);	
			КонецЕсли; 
			
		КонецЕсли;
		
		Если Выборка.ИзКарточкиОрганизации тогда    
			СтруктураПараметров.АдресОрганизации 		 	= СокрЛП(СведенияОбОрганизации.ЮридическийАдрес);	
			СтруктураПараметров.ТелефонОрганизации 		 	= СокрЛП(СведенияОбОрганизации.Телефоны);	
			СтруктураПараметров.РасчетныйСчетОрганизации 	= БухгалтерскийУчетПереопределяемый.ПолучитьБанковскийСчетПоУмолчанию(ОрганизацияДоговора,ВалютаДоговора);	
		КонецЕсли;
		
		Если Выборка.РеквизитыИзКарточкиКонтрагента тогда  
			
			СведенияОКонтрагенте = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(ДоговорВладелец, Дата);
			
			СтруктураПараметров.ЭлектронныйАдресКонтрагента	= СокрЛП(СведенияОКонтрагенте.Email);	
			СтруктураПараметров.Адрес 		 	= СокрЛП(СведенияОКонтрагенте.ЮридическийАдрес);	
			СтруктураПараметров.Телефон 		= СокрЛП(СведенияОКонтрагенте.Телефоны);	
			СтруктураПараметров.РасчетныйСчет  	= БухгалтерскийУчетПереопределяемый.ПолучитьБанковскийСчетПоУмолчанию(ДоговорВладелец, ВалютаДоговора);	
			
		КонецЕсли;
		
	КонецЕсли; 
	
	СтруктураПараметров.Вставить("ПорядокРасчета", 				СтруктураПараметров.УсловияОплаты.ПорядокРасчета);
	СтруктураПараметров.Вставить("ПодключаемаяОбработка", 		СтруктураПараметров.УсловияОплаты.ПодключаемаяОбработка);
	СтруктураПараметров.Вставить("СпособРасчетаОтсрочки", 		СтруктураПараметров.УсловияОплаты.СпособРасчетаОтсрочки);
	СтруктураПараметров.Вставить("ПроизводственныйКалендарь", 	СтруктураПараметров.УсловияОплаты.ПроизводственныйКалендарь);
	СтруктураПараметров.Вставить("ВариантПереносаДаты", 		СтруктураПараметров.УсловияОплаты.ВариантПереносаДаты);
	
	Если ПустаяСтрока(ИмяПараметра) Тогда 
		Возврат СтруктураПараметров;
	КонецЕсли;
	
	мПолучаемыеПараметры = СтрРазделить(ИмяПараметра, ";",Ложь);  
	
	РезультатСтруктура = Новый Структура;
	Для Каждого Параметр из мПолучаемыеПараметры Цикл
		РезультатСтруктура.Вставить(Параметр,  СтруктураПараметров[Параметр]); 
	КонецЦикла;  
	
	Если РезультатСтруктура.Свойство("УсловияОплаты") Тогда
		РезультатСтруктура.Вставить("ПорядокРасчета", 				СтруктураПараметров.ПорядокРасчета);
		РезультатСтруктура.Вставить("ПодключаемаяОбработка", 		СтруктураПараметров.ПодключаемаяОбработка);
		РезультатСтруктура.Вставить("СпособРасчетаОтсрочки", 		СтруктураПараметров.СпособРасчетаОтсрочки);
		РезультатСтруктура.Вставить("ПроизводственныйКалендарь", 	СтруктураПараметров.ПроизводственныйКалендарь);
		РезультатСтруктура.Вставить("ВариантПереносаДаты", 			СтруктураПараметров.ВариантПереносаДаты);
	КонецЕсли;
	
	
	Возврат РезультатСтруктура;
	
	 
КонецФункции

Функция ПолучитьТекстЗапросаПараметров(СтрокаИменПараметров)
	
	Если ПустаяСтрока(СтрокаИменПараметров) Тогда
		Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_ПараметрыДоговоровСрезПоследних.*
		|ИЗ
		|	РегистрСведений.CW_ПараметрыДоговоров.СрезПоследних(&Дата, Договор = &Договор) КАК CW_ПараметрыДоговоровСрезПоследних";
	Иначе
		Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_ПараметрыДоговоровСрезПоследних.Договор КАК Договор,";
		
		мИменаПараметров 	= СтрРазделить(СтрокаИменПараметров, ";", Ложь); 
		ГраницаЦикла 		= мИменаПараметров.Количество()-1;
		Для Индекс = 0 по ГраницаЦикла Цикл
			Текст = Текст +"
			|	CW_ПараметрыДоговоровСрезПоследних."+мИменаПараметров[Индекс]+" КАК "+мИменаПараметров[Индекс]+ ?(Индекс<ГраницаЦикла,",","");
			
		КонецЦикла;
		Текст = Текст +"
		|ИЗ
		|	РегистрСведений.CW_ПараметрыДоговоров.СрезПоследних(&Дата, Договор = &Договор) КАК CW_ПараметрыДоговоровСрезПоследних";
	КонецЕсли;
	
	Возврат Текст;

КонецФункции

// Функция - ПолучитьЗначениеПараметраДоговора
//
// Параметры:
//  ОбъектПараметров	- Ссылка "CW_ДоговорыПоГрузоперевозкам" ИЛИ Ссылка "CW_ПриложенияКДоговорам"
//  ИмяПараметра 		- Имя параметра; 
// 
// Возвращаемое значение:
//   - значение переданного параметра
//
Функция ПолучитьЗначениеПараметраДоговора(Дата, ОбъектПараметров, ИмяПараметра) Экспорт
	
	СтруктураПараметровДоговора = ПараметрыДоговора(Дата, ОбъектПараметров, ИмяПараметра);
	
	Возврат СтруктураПараметровДоговора[ИмяПараметра];
	
КонецФункции

// Функция - Получить параметры договора
//
// Параметры:
//  Параметры	 - 	 Структура параметров:
//						- Дата 					- Дата получения параметров;
//						- Договор 				- Ссылка "CW_ДоговорыПоГрузоперевозкам"
//						- ПриложениеКДоговору 	- Ссылка "CW_ПриложенияКДоговорам"
//  ИмяПараметра - 	Список имен параметров, разделенный ";" 
// 
// Возвращаемое значение:
//   - структуру со значенисями всех переданных имен парамтеров
//
Функция ПолучитьПараметрыДоговора(Параметры, ИмяПараметра="") Экспорт
	
	ОбъектПараметров = Неопределено;
	Если ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам") Тогда
		Параметры.Свойство("ПриложениеКДоговору", ОбъектПараметров);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбъектПараметров) Тогда
		Параметры.Свойство("Договор", ОбъектПараметров);
	КонецЕсли;
	
	Возврат ПараметрыДоговора(Параметры.Дата, ОбъектПараметров, ИмяПараметра);
	
КонецФункции

Функция ПустаяСтруктураПолученияПараметровДоговора() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Дата",	Неопределено);
	Результат.Вставить("Договор", Неопределено);
	Результат.Вставить("ПриложениеКДоговору", Неопределено);
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьПодписиОтветственныхЛиц(Вариант,Организация, ДатаСреза)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЛицаПодписывающиеДокументыСрезПоследних.Вариант КАК Вариант,
	               |	CW_ЛицаПодписывающиеДокументыСрезПоследних.Организация КАК Организация,
	               |	CW_ЛицаПодписывающиеДокументыСрезПоследних.Руководитель КАК РуководительОрганизации,
	               |	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительДолжность КАК ДолжностьРуководителяОрганизации,
	               |	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительДолжностьАнгл КАК ДолжностьРуководителяОрганизацииАнгл,
	               |	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительОснование КАК РуководительОснование,
	               |	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительОснованиеАнгл КАК РуководительОснованиеАнгл,
	               |	CW_ЛицаПодписывающиеДокументыСрезПоследних.ГлБухгалтер КАК ГлавныйБухгалтерОрганизации,
	               |	CW_ЛицаПодписывающиеДокументыСрезПоследних.ГлБухгалтерОснование КАК ГлавныйБухгалтерОснование,
	               |	CW_ЛицаПодписывающиеДокументыСрезПоследних.ГлБухгалтерОснованиеАнгл КАК ГлавныйБухгалтерОснованиеАнгл
	               |ИЗ
	               |	РегистрСведений.CW_ЛицаПодписывающиеДокументы.СрезПоследних(
	               |			&ДатаСреза,
	               |			Вариант = &Вариант
	               |				И Организация = &Организация) КАК CW_ЛицаПодписывающиеДокументыСрезПоследних";
	
	запрос.УстановитьПараметр("ДатаСреза", 		ДатаСреза);
	запрос.УстановитьПараметр("Вариант", 		Вариант);
	запрос.УстановитьПараметр("Организация", 	Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// --- 
Функция ПараметрУчетнойПолитики(Дата, Организация, ИмяПараметра, кэшСтрокаПараметров=Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли; 
	
	Если Неопределено = кэшСтрокаПараметров Тогда 
		СтрокаПараметров = ПараметрыУчетнойПолитики(Дата, Организация);
		кэшСтрокаПараметров = СтрокаПараметров;
	Иначе 
		СтрокаПараметров = кэшСтрокаПараметров;
	КонецЕсли;
	
	ЗначениеПараметра = Неопределено;
	СтрокаПараметров.Свойство(СокрЛП(ИмяПараметра), ЗначениеПараметра);
	
	// принудительное изменение параметров учетной политики в связи с изменением законодательства
	// (в учетной политике эти параметры блокируются для изменения и не визуализируются)
	#Область ПринудительнаяУстановкаПараметров
	
		Если ИмяПараметра = "ОбщаяСуммаСчетФактурыВСтрокахСводных" Тогда
			
			// в соответствии с постановлением Правительства РФ №981
			Если Дата >= Дата(2017,10,1) Тогда
				ЗначениеПараметра = Ложь;
			КонецЕсли; 
		КонецЕсли; 
		
		Если ИмяПараметра = ("СчетаФактурыПоПостановлению1137") или 
			(ИмяПараметра = "ТребованияПостановления735") 
		Тогда
			
			// в соответствии с постановлением Правительства РФ №735
			Если Дата >= Дата(2015,1,1) Тогда
				ЗначениеПараметра = Истина;
			КонецЕсли; 
		КонецЕсли; 
		
	#КонецОбласти 
	
	Возврат ЗначениеПараметра;
КонецФункции

//CW_Настройки.ПараметрыУчетнойПолитики(Дата, Организация)
Функция ПараметрыУчетнойПолитики(Дата, Организация) Экспорт
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_УчетнаяПолитикаСрезПоследних.*
		|ИЗ
		|	РегистрСведений.CW_УчетнаяПолитика.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|	) КАК CW_УчетнаяПолитикаСрезПоследних";

	Запрос.УстановитьПараметр("Дата", 			Дата); 
	Запрос.УстановитьПараметр("Организация", 	Организация);    
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ШаблонТекста = "Для организации %1 на дату %2 отсутствуют параметры учетной политики модуля ""Бухгалтерия экспедитора""";	
		
		ТекстОшибки = СтрШаблон(ШаблонТекста,СокрЛП(Организация), Формат(Дата, "ДФ=dd.MM.yyyy")); 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Для Каждого Колонка из РезультатЗапроса.Колонки Цикл  
		Результат.Вставить(Колонка.Имя);
	КонецЦикла; 
	
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	 
КонецФункции

Функция ПараметрУчетнойПолитикиУСН(Дата, Организация, ИмяПараметра, кэшСтрокаПараметров=Неопределено) Экспорт
	
	Если НЕ _сф.Определено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли; 
	
	Если Неопределено = кэшСтрокаПараметров Тогда 
		СтрокаПараметров = ПараметрыУчетнойПолитикиУСН(Дата, Организация);
		кэшСтрокаПараметров = СтрокаПараметров;
	Иначе 
		СтрокаПараметров = кэшСтрокаПараметров;
	КонецЕсли;
	
	ЗначениеПараметра = Неопределено;
	СтрокаПараметров.Свойство(СокрЛП(ИмяПараметра), ЗначениеПараметра);
	
	Возврат ЗначениеПараметра;
КонецФункции

Функция ПараметрыУчетнойПолитикиУСН(Дата, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаУСНСрезПоследних.*
		|ИЗ
		|	РегистрСведений.НастройкиУчетаУСН.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|	) КАК НастройкиУчетаУСНСрезПоследних"
	;
	Запрос.УстановитьПараметр("Дата", Дата); 
	Запрос.УстановитьПараметр("Организация", Организация);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если _сф.Количество(ТЗ)=0 Тогда
		Если ЗначениеЗаполнено(Организация) Тогда 
			Сообщить("У организации "+Организация+" на дату "+Дата+" не установлены параметры учетной политики (БЭ)!");
		КонецЕсли;
		СтрокаПараметров = ТЗ.Добавить();
		Для Каждого колонкаТЗ Из тз.Колонки Цикл
			Для Каждого типЗначения Из колонкаТЗ.ТипЗначения.Типы() Цикл
				Если типЗначения <> Тип("Null") Тогда 
					масс = Новый Массив;
					масс.Добавить(типЗначения);
					оп = Новый ОписаниеТипов(масс);
					СтрокаПараметров[колонкаТЗ.Имя] = оп.ПривестиЗначение(Неопределено);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	Иначе
		СтрокаПараметров = ТЗ[0];
	КонецЕсли;
	
	СП = _сф.ст_СоздатьИзТаблицы(ТЗ);
	_сф.ст_ЗаполнитьПоСтрокеТаблицы(СП,СтрокаПараметров);
	
	Возврат(СП);
	 
КонецФункции

Функция ПараметрГлобальнойУчетнойПолитики(Дата, Организация, ИмяПараметра, кэшСтрокаПараметров=Неопределено) Экспорт
	
	Если Дата=Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли; 
	
	Если Неопределено=кэшСтрокаПараметров Тогда 
		СтрокаПараметров = ПараметрыГлобальнойУчетнойПолитики(Дата, Организация);
		кэшСтрокаПараметров = СтрокаПараметров;
	Иначе 
		СтрокаПараметров = кэшСтрокаПараметров;
	КонецЕсли;
	
	// СтрокаПараметров это СтрокаТаблицыЗначений, причем строка возвращается всегда, даже когда ничего не найдено
	// а вот будет ли параметр в структуре колонок - это вопрос
	Если (СтрокаПараметров.Свойство(СокрЛП(ИмяПараметра))) Тогда
		ЗначениеПараметра = СтрокаПараметров[СокрЛП(ИмяПараметра)];
	Иначе
		ЗначениеПараметра = Неопределено;
	КонецЕсли; 
		
	Возврат ЗначениеПараметра;
	
КонецФункции      

Функция ПараметрыГлобальнойУчетнойПолитики(Дата, Организация) Экспорт

	Возврат CW_БухгалтерияЭкспедитораСерверПереопределяемый.ПараметрыУчетнойПолитикиБП(Организация, Дата);
	
КонецФункции


// Возвращает дату начала ведения бухгалтерского учета в модуле для указанной организации 
Функция ПолучитьДатуНачалаВеденияУчета(Организация) Экспорт
	
	Если Организация.Пустая() Тогда
		Возврат(Неопределено);	
	Иначе	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	CW_НачалоВеденияУчета.ДатаНачалаВеденияУчета
		                      |ИЗ
		                      |	РегистрСведений.CW_НачалоВеденияУчета КАК CW_НачалоВеденияУчета
		                      |ГДЕ
		                      |	CW_НачалоВеденияУчета.Организация = &Организация");
							  
		Запрос.УстановитьПараметр("Организация", Организация);					  
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		Для каждого Стр Из ТЗ Цикл
			Возврат(Стр.ДатаНачалаВеденияУчета);	
		КонецЦикла; 
	КонецЕсли; // организация заполнена	
КонецФункции  

Функция ПолучитьНастройкиОперативногоУчета(Организация, Знач ВидЗадолженности=Неопределено, Знач Период=Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДата();
	КонецЕсли;
	
	Возврат РегистрыСведений.CW_НастройкиУчетаОперативнойЗадолженности.ПолучитьНастройкиУчетаОперативнойЗадолженности(Организация, ВидЗадолженности, Период);
	
КонецФункции

// --- 

Функция ВалютаРегламентированногоУчета() Экспорт 
	// --- 
	
	Возврат(CW_Настройки_ПИ.ВалютаРегламентированногоУчета());
	
	// --- 
КонецФункции

  
Функция ОсновнаяОрганизация() Экспорт 
 
	тОсновнаяОрганизация = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОсновнаяОрганизация");
	 
	Если НЕ ЗначениеЗаполнено(тОсновнаяОрганизация) Тогда
	    тОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"); 
	КонецЕсли;

  	Возврат тОсновнаяОрганизация;
КонецФункции
Функция ОсновнаяСтавкаНДС() Экспорт 
	// --- 
	
	// ВызовБП
	Возврат(БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяСтавкаНДС"));
	
	// --- 
КонецФункции

// --- 

Функция Отладка() Экспорт 
	// --- 
	
	Возврат(ПолучитьНастройкуПользователя(,"РежимОтладкиВключен"));
	
	// --- 
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Функции для работы с настройкой рабочей даты.

// Сохраняет настройку рабочей даты пользователя.
//
// Параметры:
//	НоваяРабочаяДата - Дата - дата, которую необходимо установить в качестве рабочей даты пользователя.
//	ИмяПользователя - Строка - имя пользователя, для которого устанавливается рабочая дата.
//		Если не задано, то устанавливается для текущего пользователя.
//			
Процедура УстановитьРабочуюДатуПользователя(НоваяРабочаяДата, ИмяПользователя = Неопределено) Экспорт

	КлючОбъекта = ВРег("БухгалтерияЭкспедитораРабочаяДата");
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта, "", НоваяРабочаяДата,, ИмяПользователя);

КонецПроцедуры

// Возвращает значение настройки рабочей даты для пользователя.
//
// Параметры:
//	ИмяПользователя - Строка - имя пользователя, для которого запрашивается рабочая дата.
//		Если не задано, то устанавливается для текущего пользователя.
//
// Возвращаемое значение:
//	Дата - значение настройки рабочей даты пользователя или пустая дата, если настройка не задана.
//
Функция РабочаяДатаПользователя(ИмяПользователя = Неопределено) Экспорт

	КлючОбъекта = ВРег("БухгалтерияЭкспедитораРабочаяДата");

	Результат = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта,"",, ИмяПользователя);
	
	Если ТипЗнч(Результат) <> Тип("Дата") Тогда
		Результат = '0001-01-01'; 
	Иначе  
		Если ЗначениеЗаполнено(Результат) Тогда
			ТекущееВремяВСекундах = ТекущаяДата() - НачалоДня(ТекущаяДата()); 
			Результат = Результат + ТекущееВремяВСекундах;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение настройки рабочей даты для пользователя или текущей даты сеанса,
// если рабочая дата пользователя не задана.
//
// Параметры:
//	ИмяПользователя - Строка - имя пользователя, для которого запрашивается рабочая дата.
//		Если не задано, то устанавливается для текущего пользователя.
//
// Возвращаемое значение:
//	Дата - значение настройки рабочей даты пользователя или текущая дата сеанса, если настройка не задана.
//
Функция ТекущаяДатаПользователя(ИмяПользователя = Неопределено) Экспорт

	Результат = РабочаяДатаПользователя(ИмяПользователя);
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
